#+TITLE: August 7, 2017 - August 22, 2017
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS                                        | WAITING | DONE                                                       | CANCELED |
|------+------+----------------------------------------------------+---------+------------------------------------------------------------+----------|
|      |      | READING.1502439312. Watch videos on "Literate Prog |         | READING.1502388306. Locally sensitive hashing (2017-08-14) |          |
|      |      | WRITING.1502388337. Implementing locally sensitive |         |                                                            |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME          | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|---------------+-----------+--------+------+-----------+--------------+------------|
| Jasonbraganza |       3.0 |      0 |    0 |       3.0 |   2017-08-17 | ---------- |
| Ikshitji      |         0 |      0 |    0 |         0 |   2017-08-14 | ---------- |
| Amey          |       6.0 |    6.0 |  2.0 |       4.0 |   2017-08-16 | ###------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph

#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:16]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED    |
|-----+------------+--------+-------+--------------------|
|   1 | 2017-08-07 |  107.0 |   100 |                    |
|   2 | 2017-08-08 |  107.0 |    94 |                    |
|   3 | 2017-08-09 |  107.0 |    87 |                    |
|   4 | 2017-08-10 |  107.0 |    80 |                    |
|   5 | 2017-08-11 |  107.0 |    74 |                    |
|   6 | 2017-08-12 |  107.0 |    67 |                    |
|   7 | 2017-08-13 |  107.0 |    60 |                    |
|   8 | 2017-08-14 |  105.0 |    54 | READING.1502388306 |
|   9 | 2017-08-15 |        |    47 |                    |
|  10 | 2017-08-16 |        |    40 |                    |
|  11 | 2017-08-17 |        |    33 |                    |
|  12 | 2017-08-18 |        |    27 |                    |
|  13 | 2017-08-19 |        |    20 |                    |
|  14 | 2017-08-20 |        |    13 |                    |
|  15 | 2017-08-21 |        |     7 |                    |
|  16 | 2017-08-22 |        |     0 |                    |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                        | TASKID             | OWNER         | PRIORITY | TODO        | ESTIMATED | ACTUAL |
|-------------------------------------------------------------+--------------------+---------------+----------+-------------+-----------+--------|
| TASKS                                                       |                    |               | B        |             |     107.0 |    6.0 |
|-------------------------------------------------------------+--------------------+---------------+----------+-------------+-----------+--------|
| READING                                                     |                    |               | B        |             |      21.0 |    6.0 |
| Locally sensitive hashing                                   | READING.1502388306 | amey          | B        | DONE        |       2.0 |    6.0 |
| Watch Grafana tutorials on creating dashboards              | WEB.1502389401     | ikshitij      | B        |             |       8.0 |        |
| Watch videos on "Literate Programming"                      | READING.1502439312 | jasonbraganza | B        | IN_PROGRESS |       3.0 |        |
| Review Python Literate Programming tools                    | READING.1502439349 | jasonbraganza | B        |             |       8.0 |        |
|-------------------------------------------------------------+--------------------+---------------+----------+-------------+-----------+--------|
| WRITING                                                     |                    |               | B        |             |      34.0 |        |
| Implementing locally sensitive hashing                      | WRITING.1502388337 | amey          | B        | IN_PROGRESS |       4.0 |        |
| Implementing structure to carry min-hash and timing details | WRITING.1502388357 | amey          | B        |             |       6.0 |        |
| Joining files together                                      | WRITING.1502388372 | amey          | B        |             |       6.0 |        |
| Debugging information to be added                           | WRITING.1502388385 | amey          | B        |             |       2.0 |        |
| Tool B                                                      | WRITING.1502388395 | amey          | B        |             |       8.0 |        |
| Blog post on Literate Programming tools in Python           | WRITING.1502439417 | jasonbraganza | B        |             |       8.0 |        |
|-------------------------------------------------------------+--------------------+---------------+----------+-------------+-----------+--------|
| TESTING                                                     |                    |               | B        |             |      20.0 |        |
| Testing tool and implementation                             | TESTING.1502388425 | amey          | B        |             |      12.0 |        |
| Experiment Python Literate Programming in a PYM chapter     | TESTING.1502439390 | jasonbraganza | B        |             |       8.0 |        |
|-------------------------------------------------------------+--------------------+---------------+----------+-------------+-----------+--------|
| WEB                                                         |                    |               | B        |             |      32.0 |        |
| Setup Grafana from source code                              | WEB.1502388953     | ikshitij      | B        |             |       8.0 |        |
| Add MySQL database configuration                            | WEB.1502389364     | ikshitij      | B        |             |       8.0 |        |
| Load CSV data into MySQL                                    | WEB.1502389380     | ikshitij      | B        |             |       8.0 |        |
| Create custom Grafana dashboard                             | WEB.1502389411     | ikshitij      | B        |             |       8.0 |        |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2017-08-07 Mon>
  :wpd-amey:      2.5
  :wpd-ikshitji:  1.0
  :wpd-jasonbraganza: 1.0
  :END:
** READING
*** DONE Locally sensitive hashing
    CLOSED: [2017-08-14 Mon 13:05]
    :PROPERTIES:
    :ESTIMATED: 2.0
    :ACTUAL: 6.0
    :OWNER: amey
    :ID: READING.1502388306
    :TASKID: READING.1502388306
    :END:
    CLOCK: [2017-08-12 Sat 19:23]--[2017-08-12 Sat 20:00] =>  0:37
    CLOCK: [2017-08-12 Sat 15:04]--[2017-08-12 Sat 15:54] =>  0:50
    CLOCK: [2017-08-12 Sat 11:16]--[2017-08-12 Sat 12:10] =>  0:54
    CLOCK: [2017-08-11 Fri 10:10]--[2017-08-11 Fri 11:05] =>  0:55
    CLOCK: [2017-08-11 Fri 20:02]--[2017-08-11 Fri 20:55] =>  0:53
    CLOCK: [2017-08-10 Thu 10:55]--[2017-08-10 Thu 11:15] =>  0:20
    CLOCK: [2017-08-09 Wed 08:50]--[2017-08-09 Wed 09:30] =>  0:40
    CLOCK: [2017-08-08 Tue 11:35]--[2017-08-08 Tue 12:26] =>  0:51
** WRITING
*** IN_PROGRESS Implementing locally sensitive hashing
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: WRITING.1502388337
    :TASKID: WRITING.1502388337
    :END:
    CLOCK: [2017-08-14 Mon 11:34]--[2017-08-14 Mon 12:33] =>  0:59
    CLOCK: [2017-08-13 Sun 14:00]--[2017-08-13 Sun 15:17] =>  1:17
    CLOCK: [2017-08-13 Sun 13:31]--[2017-08-13 Sun 13:47] =>  0:16
    CLOCK: [2017-08-13 Sun 11:52]--[2017-08-13 Sun 12:27] =>  0:35

